{
  "frontend": [
    {
      "id": 1,
      "nombre": "Encuentra tu super héroe",
      "imagen": "./img/preview-super-hero.png",
      "imagen2": "./img/super-hero-card-stats.png",
      "descripcion": "Aplicación para encontrar a tu super héroe favorito",
      "tecnologias": ["HTML5", "CSS", "Bootstrap", "Javascript", "JQuery", "CanvasJS"],
      "objetivo": "Desarrollo de una aplicación dinámica que permita a los usuarios buscar un Super Héroe o Super Heroína y visualizar información referente al personaje buscado.",
      "requerimientos": [
        "Crear la estructura básica para la página web implementando HTML, que incluya un formulario de búsqueda. Utilizar etiquetas semánticas de HTML5 para definir y separar las secciones",
        "Agregar estilos mediante Bootstrap y/o CSS, implementando por ejemplo menús de navegación y botones.",
        " Solicitar información a la API, capturarla y validarla, luego mostrar la información dinámicamente mediante la librería jQuery y CanvasJS con un gráfico de torta."
      ],

      "desarrollo": [
        "Importación vía CDN de Bootstrap, Jquery y CanvasJS",
        "Estructuración del index con una barra de navegación y una section con dos contenedores. Un contenedor para el header y el formulario de busqueda y el otro contenedor para la carga del superheroe desde la API y el gráfico de CanvaJS"
      ],
      "github": "https://github.com/SingularPigeon/SuperHeroAplicacion",
      "app": "https://singularpigeon.github.io/SuperHeroAplicacion/"
    },
    {
      "id": 2,
      "nombre": "¿Quién es ese pokemón?",
      "imagen": "./img/preview-pokemon.png",
      "imagen2": "./img/pokemon-filtro.png",
      "descripcion": "Juego pokédex para descubrir pokemones",
      "tecnologias": ["HTML5", "CSS", "Bootstrap", "Vuejs", "Vue router", "Pinia"],
      "objetivo": "Crear una aplicación con temática de la serie Pokémon haciendo uso de la PokéAPI",
      "requerimientos": [
        "Mostrar 20 pokemones cuyas imágenes poseen en primera instancia un filtro que no deja ver con claridad cuál pokémon es.",
        "Permitir el ingreso del nombre del pokemón por medio de un input debajo de cada una de las imágenes.",
        "Al presionar en el botón “Descubrir” o apretar la tecla Enter, en caso de que el usuario haya escrito correctamente el nombre del pokémon deberá descubrirse quitando el filtro aplicado por defecto, de lo contrario se debe mostrar una ventana emergente indicando que el nombre ingresado es incorrecto.",
        "Ocultar el input y el botón y dejar el nombre del pokémon descubierto",
        "Mostrar un contador con la cantidad de pokémons descubiertos hasta el momento."
      ],
      "github": "https://github.com/SingularPigeon/Desafio-vue-pokemon",
      "app": "https://singularpigeon.github.io/Desafio-vue-pokemon/"
    },
    {
      "id": 3,
      "nombre": "Tienda 32 bits",
      "imagen": "./img/preview-tienda-32.png",
      "descripcion": "Stock tienda 32 bits",
      "tecnologias": ["HTML5", "CSS", "Bootstrap", "Vuejs", "Vue router", "Pinia"],
      "objetivo": "Desarrollar de una aplicación SPA utilizando VueJS mediante la creación del proyecto con Vite, además la incorporación Pinia para controlar todos los datos de forma centralizada.",
      "requerimientos": [
        "Crear un proyecto con Vite",
        "Alojar el JSON de juegos en el estado global de la aplicación.",
        "Utilizar mapState para el consumo de los juegos en el componente App",
        "Utilizar acciones para modificar el stock de los videojuegos."
      ],
      "github": "https://github.com/SingularPigeon/Desafio-Pinia",
      "app": "https://SingularPigeon.github.io/Desafio-Pinia/"
    },
    {
      "id": 4,
      "nombre": "Crud Usuarios",
      "imagen": "./img/preview-usuarios.png",
      "descripcion": "Crear, leer, actualizar y eliminar usuarios",
      "tecnologias": ["HTML5", "CSS", "Bootstrap", "Vuejs", "Vue router", "Firebase"],
      "objetivo": "Crear un sistema que pueda crear un usuario, editar usuarios, eliminar usuarios y listar los usuarios",
      "requerimientos": [
        "Almacenar datos recibidos de Firestore en un objeto data()",
        "Crear un componente que agregue nuevos usuarios a la base de datos",
        "Crear un componente que muestre todos los usuarios registrados.",
        "Permitirle a los usuarios de la aplicación eliminar los registros de la base de datos."
      ],
      "github": "https://github.com/SingularPigeon/Desafio-Firebase",
      "app": "https://crud-usuarios-bfaa1.web.app/"
    }
  ],
  "graphicDesign": [
    {
      "id": 5,
      "nombre": "Pendones cartelera Teatro Sidarte",
      "imagen": "./img/portada-exit.png",
      "imagen2": "./img/fotos-pendones.png",
      "imagen3": "./img/pendones-sidarte.png",
      "descripcion": "Pendones impresos en PVC para cartelera del Teatro Sidarte",
      "tecnologias": ["Adobe Illustrator", "Adobe Photoshop"],
      "objetivo": "Diseñar pendón con la cartelera mensual de cada sala del teatro",
      "requerimientos": [
        "Los pendones deben incluir fotografía, temporada(fechas y horarios), sala en que se presenta, reseña, ficha técnica,logos del teatro, MINCAP. Medidas: 90 cm x 180 cm, soporte: PVC"
      ]
    },
    {
      "id": 6,
      "nombre": "Programa mensual de obras Teatro Sidarte ",
      "imagen": "./img/portada-programa-mensual.png",
      "imagen2": "./img/programa-sep-oct-sidarte-2.png",
      "imagen3": "./img/programa-sep-oct-sidarte.png",
      "imagen4": "./img/programa-exit.png",
      "imagen5": "./img/programa-exit-2.png",
      "imagen6": "./img/programa-colectivo-zoo-1.png",
      "imagen7": "./img/programa-colectivo-zoo-2.png",
      "descripcion": "Programas cartelera mensula de obras del Teatro sidarte",
      "tecnologias": ["Adobe Illustrator", "Adobe Photoshop"],
      "objetivo": "Diseñar un tr´ptico o cuadríptico con la cartelera de las obras del Teatro Sidarte",
      "requerimientos": [
        "El cuadriptico debe llevar portada, detalle de las obras a presentar, valores,ficha del equipo del teatro, logos de auspiciadores y media partners",
        "El detalle de las obras debe incluir nombre,fotografía,reseña, fecha, horario y sala en que se presenta."
      ]
    },
    {
      "id": 7,
      "nombre": "Gráficas redes sociales Teatro Sidarte",
      "imagen": "./img/portada-graficas-web.png",
      "imagen2": "./img/muerte-explosion-afiche.png",
      "imagen3": "./img/las-cosas-afiche.png",
      "imagen4": "./img/los-hape-teatro.png",
      "imagen5": "./img/laboratorio-actuacion.png",

      "descripcion": "Diseño de gráficas para redes sociales",
      "tecnologias": ["Adobe Illustrator", "Adobe Photoshop"],
      "objetivo": "Diseñar gráficas para la promoción de las obras en cartelera, talleres y eventos en redes sociales",
      "requerimientos": [
        "Diseño cuadrado, principalmete para Instagram con la foto de la obra, nombre, temporada, tiquetera, logos y página web del teatro."
      ]
    },
    {
      "id": 8,
      "nombre": "Gráficas para la compañia teatral La Mona Ilustre",
      "imagen": "./img/portada-monailustre.png",
      "imagen2": "./img/dossier-male-1.png",
      "imagen3": "./img/dossier-male-2.png",
      "imagen4": "./img/impresos-male.png",
      "descripcion": "Dossier, pendón e invitación para la obra de teatro Malè",
      "tecnologias": ["Adobe Illustrator", "Adobe Photoshop"],
      "objetivo": "Diseñar dossier para la venta de funciones de la obra y diferentes piezas gráficas para promoción",
      "requerimientos": [
        "Dossier ensencialmente fotográfico, que destaque la escencia de la obra.",
        "Pendón para instalar en el frontis del Teatro Municipal de Las Condes.",
        "Invitación para campaña de mailing para el estrenola obra de teatro Malè."
      ]
    },
    {
      "id": 9,
      "nombre": "Diseño para albúm debut",
      "imagen": "./img/portada-cigarras.png",
      "imagen2": "./img/FRONT3.jpg",
      "imagen3": "./img/back3B.jpg",
      "imagen4": "./img/diseno-polimero-cigarras.png",
      "descripcion": "Diseño de sobre, carátula y booklet",
      "tecnologias": ["Adobe Illustrator", "Adobe Photoshop"],
      "objetivo": "Diseñar sobre y caratula para disco",
      "requerimientos": [
        "El sobre debe tener en el frontis: foto y nombre del cantautor, nombre del disco y en la trasera debe tener el listado de canciones, logos de auspiciadores y partners.",
        "La caratula debe tener la imagen de la hormiga y la cigarra."
      ]
    },
    {
      "id": 10,
      "nombre": "Logotipos para pymes",
      "imagen": "./img/portada-logos.png",
      "imagen2": "./img/logo-gespro.png",
      "imagen3": "./img/logo-colibri.png",
      "imagen4": "./img/logo-pollos.png",
      "imagen5": "./img/logo-fr.png",
      "descripcion": "Diseño de diversos logotipos para pymes",
      "tecnologias": ["Adobe Illustrator", "Adobe Photoshop"],
      "objetivo": "Diseño y rediseño de logotipos según los requerimientos de cada cliente.",
      "requerimientos": [
        "Logo GESPRO: crear un isologo que reflejara confianza, cercanía y transparencia.",
        "Logo Colibrí Design: la aplicación de un colibrí con formas geométricas en monocromía.",
        "Logo Pollos Tobalaba: realizar un imagologo en monocromía con la imagen de un gallo y el nombre del comercio.",
        "Logo Ingeniero Eléctrico:  realizar un imagologo con las iniciales de su nombre y el texto “soluciones eléctricas”."
      ]
    }
  ]
}
